#include "D1.h"


D1::D1(): B1(), B2(), B3() { d1 = 0; }     //конструктор за умовчанням(без параметрів)

D1::D1(int v_d1, int v_b1, int v_b2, int  v_b3): B1(v_b1), B2(v_b2), B3(v_b3) {    //конструктор ініціалізації
	d1 = v_d1;
}

D1::~D1() {}    //деструктор --- для звільнення пам'яті виділеної для певного об'єкта

void D1::show() {  //метод для виведення інформації про тип об’єкта цього класу та про значення його полів
	std::cout << "\nclass D1:";
	B1::show();
	B2::show();
	B3::show();
	std::cout << "\n\nshow_D1()"
		<< "\nD1::d1 = " << d1;
}