#include "D4.h"


D4::D4() : D2() { d4 = 0; }    //конструктор за умовчанням(без параметрів)

D4::D4(int v_d4, int v_d2, int v_b1, int v_b2, int v_b3, int v_d1, int v_d3)  //конструктор ініціалізації
	: D2(v_d2, v_b1, v_b2, v_b3, v_d1, v_d3) {
	d4 = v_d4;
}

D4::~D4() {}   //деструктор --- для звільнення пам'яті виділеної для певного об'єкта

void D4::show() {  //метод для виведення інформації про тип об’єкта цього класу та про значення його полів
	std::cout << "\nclass D4:";
	D2::show();
	std::cout << "\n\nshow_D4()"
		<< "\nD4::d4 = " << d4;
}